Revit 2027 API
ColorSelectionDialog.OriginalColor Property
 The original color.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Color OriginalColor { get; set; }
Public Property OriginalColor As Color
	Get
	Set
public:
property Color^ OriginalColor {
	Color^ get ();
	void set (Color^ value);
}
member OriginalColor : Color with get, set
Property Value
Color
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ColorSelectionDialog Class
Autodesk.Revit.UI Namespace